{
    "OpenSea": "Founded by Devin Finzer and Alex Atallah in 2017, OpenSea is a decentralized marketplace for the purchase and sale of NFTs. Users can buy, collect, trade and gift NFTs on the marketplace. Developers can run an in-app economy with OpenSea.js, run their own marketplace and access the OpenSea API for data on sales, listings, bids and transfers. The platform has one of the lowest commission fees for purchasing and selling NFTs.\n\nTo date, OpenSea has raised over $427M with their most recent Series C raise capturing $300M from investors including Coatue and Paradigm.NFT Dapps",
    "Polygon": "Polygon (originally Matic Network) was founded in 2017 by Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. Polygon is an Ethereum  scaling solution that offers developers low transaction fees and fast transaction processing speeds.\n\n\n\nPolygon employs a modified proof-of-stake consensus mechanism that allows for consensus with each block. In order to validate Polygon network transactions, network participants must stake MATIC, the native token of Polygon. Polygon validators that behave are rewarded with MATIC.\n\n\n\nNotable customers of Polygon include some of the largest web2 brands such as Starbucks, Reddit, and Coca-Cola. Large web3 companies like OpenSea and Magic Eden have also announced support for Polygon.Blockchains",
    "0x": "0x was founded in 2017 by Will Warren, and is one of the oldes decentralized exchanges. To date, 0x has raised $109 million dollars with their most recent Series B close which raised $70M by investors including Pantera Capital and Jump Crypto.\n\n0x is a free-to-use Ethereum-based exchange that enables developers and businesses to build decentralized exchanges securely and quickly. By using 0x's open-source smart contracts, users can build trading protocols that enable direct non-custodial wallet-to-wallet trading between any ERC-20 and ERC-723 tokens. \n\nThe 0x network is powered by nodes that host an off-chain order book that facilitates transactions by using their ZRX token. DeFi Dapps",
    "Forta": "Forta is a real-time decentralized cybersecurity network running on Ethereum, Polygon, and multiple other blockchains. Founded in 2021, Forta was incubated by OpenZeppellin, and today is trusted by some of the largest web3 dapps including dYdX, Compound, Lido, and MakerDAO.\n\nWith thousands of backers, hundreds of protocols, and standalone users, Forta's community-run security network has protected 10s of billions of valuable assets from exploits.\n\nUsers can subscribe to dapp security monitoring for web3 projects they have an interest in, and web3 developers can use the Forta SDK to build threat detection bots, and set up nodes to extend the Forta network across chains.Web3 Security Tools",
    "Developer DAO": "Developer DAO is one of the most popular DAOs with over 80k followers on Twitter, and It is made up of holders of the DAO's genesis NFTs, \"Devs for Revolution\". Developer DAO was founded by Nader Dabit, a prolific developer relations professional who previously worked at Edge & Node (The Graph), Celestia, and is now the Director of Developer Relations at Aave.\n\nOnce joining the DAO, contributors can do a variety of things. In the DAO, they can join guilds to work on projects, join weekly calls to discuss potential future initiatives, and more. \n\nIf you're a web3 developer who's looking to join a community of like-minded individuals, then you should try to join Developer DAO.DAOs",
    "Pantera Capital": "Pantera was founded by former Tiger Management CFO Dan Morehead in 2013 when bitcoin was trading at $65. Pantera is notably the first cryptocurrency fund in the United States in focused exclusively on blockchain technology.\n\nPantera has multiple funds including a venture capital fund and an early stage token fund. Pantera's notable venture investments include the decentralized exchange aggregator 1inch, the Ethereum Layer 2 network Arbitrum, and Coinbase, the leading cryptocurrency exchange in the United States.\n\nSome of Pantera's early stage token investments include 0x, Cosmos, Polkadot, PsyOptions, Filecoin, and Livepeer.Venture Capital Firms",
    "Rainbow": "Rainbow is a fun, easy, and secure Ethereum wallet that was founded in 2019 by Christian Baroni, Jin Chung, and Mike Demarais. Rainbow can be used to manage and display Ethereum-based assets, and connect to the most popular NFT and DeFi applications in the Ethereum ecosystem. Rainbow is a mobile and desktop Ethereum wallet with a colorful and simple user interface that makes finance friendly. With native support for ENS domain names and bridging to Layer 2s like Polygon, Arbitrum, Base, and Optimism, Rainbow wallet is a great choice for newcomers and power users alike.Web3 Wallets",
    "ZenGo": "ZenGo is a multichain MPC wallet that was founded by Ouriel Ohayon in 2018. Zengo supports over 70+ crypto assets and can be used to connect to 1000s of NFT and DeFi applications. Zengo has raised $24M in venture capital to date with their most recent Series A raise in April 2021 netting the startup $20M from VC firms including Insight Partners and FJ Labs.\n\nZenGo emphasizes security and uses two independently created mathematical “secret shares” to avoid a single-point-of-failure. ZenGo also employs three factor authentication (3FA) so wallet customers can use a 3D biometric face scan, an email account, or ZenGo's recovery kit to easily recover funds if a device is lost or stolen.Web3 Wallets",
    "Mint Kudos": "Mint Kudos is a DAO achievement tool that lets anyone mint Kudos tokens, non-transferrable NFTs, to recognize community member contributions. Mint Kudos was founded in 2022 by Catherine Chang and Kei Yoshikoshi, and is currently deployed on Polygon. Some of Mint Kudos notable users include Women Build Web3, Developer DAO, and Alchemy University.\n\nBy using non-transferable NFTs, Mint Kudos enables DAOs to reward contributors for actions such as winning an award, completing a certification, or attending a conference because the tokens cannot be bought, sold, or traded.\n\nMint Kudos is free, no-code solution that also offers an API for more scalable minting and distribution of non-transferable achievement-based NFTs.DAO Tools",
    "Polygon zkEVM": "Polygon zkEVM is an EVM equivalent ZK rollup scaling solution. All existing smart contracts, developer toolings and wallets work seamlessly. Polygon zkEVM uses the zero-knowledge proofs (validity proofs) to lower transaction costs and increase throughput, while inheriting the base-layer security of Ethereum. Web3 developers can build dApps on zkEVM in the same exact manner as building dApps on Ethereum. All devs need to do is switch their RPC URL endpoint to a zkEVM RPC node provider to start accessing higher throughput and lower fees. The developer experience on zkEVM is seamless, and no special toolings or new wallets are required for building or interacting with zkEVM. Developers can deploy their smart contracts to the zkEVM, and users can deposit assets from Ethereum and transact off-chain. These transactions are grouped into batches with zero-knowledge proofs attesting to the validity of each transaction.Blockchains",
    "RainbowKit": "RainbowKit is fast and free web3 wallet integration toolkit that enables dapp developers an easy way for users to connect their wallet to a decentralized applications frontend user interface. \n\nDevelopers that use RainbowKit give dapp users the luxury of choosing their favorite wallet, and is the wallet onboarding toolkit preferred by popular web3 teams including Zora, Showtime, the Ethereum Name Service (ENS), and the Optimism Bridge.\n\nCompared other wallet toolkits, RainbowKit lets developers customize the user experience with custom themes, wallet lists, chains, and connect buttons.Web3 Wallet Tools",
    "Phantom Wallet": "Phantom was built by Chris Kalani, Francesco Agosti, and Brandon Millman after brainstorming a Solana-native wallet.\nPhantom is a non-custodial wallet that is compatible with assets on the Solana blockchain. With Phantom, users can trade, receive, send, and store assets conveniently.\nIt is also compatible with hardware wallets, especially Ledger, for tighter security. Phantom is available on mobile phones and also exists as a browser extension. \nIn May 2023, Phantom launched wallet support for Polygon and Ethereum.Web3 Wallets",
    "Magic Eden": "Launched in September 2021, Magic Eden is an NFT marketplace that runs on the\nSolana blockchain. Users can buy, mint and sell NFTs on the platform. Developers\ncan use Magic Eden's API to request various endpoints and integrate data into\ntheir own programmes. Magic Eden has low transaction costs and does not charge\ncreators for listing NFTs.NFT Dapps",
    "Tally": "Tally is a distinctive DAO tool that provides three custom solutions at once: a\ncustomizable payout system for use within and outside a DAO, an on-chain\ngovernance feature that facilitates voting, and the ability to recognize\nusernames (ENS) rather than needing to use addresses when contributing to DAOs. \n\nBy making it easier to govern, Tally hopes to spur on the growth and\ncontributions of decentralized organizations and make better connections among\ntheir members. DAO Tools",
    "Slingshot": "Founded in 2020, Slingshot is a DeFi application that can be used to search for, send, receive and swap over 50k cryptocurrencies at the best prices, with 0% swap fees. Slingshot is available both on desktop (Slingshot Web App) and on mobile (Slingshot Wallet), with multi-chain and bridging support for the following networks: Arbitrum, Arbitrum Nova, Binance BNB Chain, Optimism, Base, Polygon, ETH Mainnet, and Canto (bridging support coming soon). Slingshot is continuously releasing enhanced product features and reward-driven participation opportunities for their growing community.DeFi Dapps",
    "Ethereum": "Ethereum is a decentralized software platform based on blockchain technology. It\nis most famous for its native cryptocurrency, ether (ETH).\n\nDevelopers use Ethereum to create decentralized digital technologies such as\nsmart contracts, tokens, and decentralized applications (Dapps). \n\nCreated with the goal of being scalable, programmable, secure, and\ndecentralized, Ethereum is the blockchain of choice for developers and\nbusinesses, changing how many industries operate and how we live our lives.Blockchains",
    "Kraken": "Kraken is a United States–based cryptocurrency exchange and bank, founded in\n2011. Users can invest in cryptocurrency and leverage Kraken's tools and\nfeatures to grow their portfolio. Developers can use the REST API to connect to\npublicly endpoints.\n\nKraken was one of the first bitcoin exchanges to be listed on Bloomberg Terminal\nand is reportedly valued at $10.8 billion USD, as of mid-summer 2022.Trading Tools",
    "Robinhood": "Founded in 2013 by Vladimir Tenev and Baiju Bhatt, Robinhood is a financial\nservices company. Users can use the platform for commission-free investing, and\naccess tools including stocks, options, ETF and cryptocurrency trading for\ninvestment purposes. Unlike many crypto exchanges, Robhinhood does not charge a\nfee for buying and selling cryptocurrency.Trading Tools",
    "The Graph": "The Graph saves developers' effort and resources building their own servers or\nperforming long processes to search through data by indexing and querying data\nfrom NEAR and EVM blockchains.\n\nUsers can query liquidity data from published subgraph services like Sushi or\nMessari.\n\nDevelopers can create, publish, and distribute subgraphs to make interchain data\nqueries easier.Infrastructure Tools",
    "Uniswap": "As one of the first and largest Ethereum-based decentralized exchanges, Uniswap\npioneered the concept of an automated market maker, which other decentralized\nexchanges are based on. Instead of using order books, Uniswap aggregates\nliquidity through pre-funded and user-funded liquidity pools (LPs). \n\nFirst launched in 2018 by CEO Hayden Adams, Uniswap's ecosystem has now further\nexpanded to include applications such as stablecoins, governance systems, and\nanalytics platforms.DeFi Dapps",
    "Collab.Land": "Collab Land is a standardized bot for community management and engagement. The\nbot can be added to either Telegram or Discord communities.\n\nThe most unique feature of the Collab Land is that it tracks and only gives\nmembership access to those who hold your token, automatically kicking out anyone\nwho sells them. NFT Tools",
    "LayerZero": "LayerZero is a protocol that facilitates interaction between separate\nblockchains and ecosystems.\n\nIt does so with its underlying oracle and relayer that allows for cross-chain\nmessaging and verification.\n\nLayerZero supports a wide array of blockchains including Aptos, Avalanche,\nPolygon, and Harmony.DeFi Tools",
    "CowSwap": "CowSwap is a decentralized finance application for the Ethereum blockchain.\nCowSwap tries to settle buy and sell orders between its users, i.e., find a\ncoincidence of wants (CoW), which prevents slippage and fees. \n\n\n\nOrders that fail to find a peer-to-peer match are sent to CowSwap’s underlying\nautomated market maker. CowSwap enables its users to execute trades at the best\nprice on-chain across all exchanges and aggregators, such as Uniswap and\nSushiswap.DeFi Dapps",
    "Hardhat": "Hardhat is one of the most popular programming environments based on Javascript\nfor developing Ethereum-based decentralized applications.\n\nHardhat aims to make smart contract development seamless by automating certain\nsteps and providing developers with a diversity of helpful, innovative\nfunctions.\n\nThe Hardhat environment combines a pre-built local Ethereum network focused on\nSolidity development with a multitude of functional plugins and debugging\nfeatures. Web3 Developer Tools",
    "Spearmint": "Spearmint is an Ethereum-based non-fungible token (NFT) platform that enables\ndevelopers to create and manage allowlists, reducing development time. \n\nNFT developers use allowlists to reward the most active community members while\nkeeping bots and attackers at bay. They can also track the growth of their\ncommunity through the Spearmint platform. Users on the allowlist get an\nopportunity to mint NFTs before the public sale and avoid gas wars.NFT Tools",
    "Solana": "Solana is a blockchain platform for hosting decentralized, scalable\napplications. It was founded in 2017 as an open-source project by the Solana\nFoundation in Geneva, with the blockchain built by Solana Labs in San Francisco.\n\nSolana is much faster in terms of transaction processing capacity and has\nsignificantly lower transaction fees than rival blockchains such as Ethereum.Blockchains",
    "Slither": "Slither is a contract security framework written in Python and first conceived\nin a 2019 paper from Josselin Feist, Gustavo Grieco, and Alex Groce.\n\nThe Slither framework provides automated vulnerability and optimization\ndetection, as well as assistive codebase summaries to further developer\ncomprehension.\n\nBorn of Crytic, the blockchain security arm of Trail of Bits, Slither is Hardhat\nand Truffle compatible, and operational for Solidity code written in V0.4\nonwards.   Solidity Tools",
    "Optimism": "Founded in 2019, Optimism is an L2 blockchain built by Ethereum developers that\nprocesses its transactions in batches using optimistic rollups. Users gain\naccess to cheap and near instantaneous transactions are cheap and nearly\ninstantaneous. Developers can use Optimism as a fast, stable, scalable and\nsecure solution to programmes requiring Ethereum apps.  Blockchains",
    "Safe": "Safe is a smart contract wallet that allows users to define a list of owner accounts and a quorum of owners required to confirm a transaction. However, it's underlying open source protocol and SDKs serve as a foundation for enabling Account Abstraction features such as Sponsored Transactions, Account Recovery, Transaction Batching, Fraud Monitoring and Spending Policies.Web3 Wallets",
    "Stripe Crypto Onramp": "Stripe's crypto onramp gives crypto businesses like DEXs, NFT Marketplaces, wallets, dApp, and more an easy and fast way for their consumers to purchase crypto. Top web3 companies like MyEtherWallet,, Magic Eden, Audius, and Argent trust Stripe's crypto onramp to give users a seamless experience that is optimized for conversion and instant settlement of crypto. With just 10 lines of code, web3 developers can integrate an onramp that abstracts away all of the complexity of piecing together multiple third-party KYC, payments, fraud, and compliance services. If you’re interested in integrating our onramp, please sign up for the waitlist, and we’ll reach out to you soon. Web3 Wallet Tools",
    "Manifold": "The Manifold protocol is a complete NFT toolkit that aims to return full control\nto digital creators through NFTs. Founded in 2021 by Eric Diep, Manifold enables\ncreators to mint unique and dynamic NFTs through immutable contracts, as well as\ncreate NFT galleries and auction sites. Developers can also use Manifold to\nbuild on NFT experiences with configurable widgets, APIs, and frameworks.NFT Tools",
    "Goldsky": "Goldsky lets you build real-time data streams for your applications without the hassle of managing complex blockchain and data streaming infrastructure. Goldsky can index a blockchain or subgraph, transform the data to fit your needs, and stream the results into a data warehouse, webhooks or an API, all in real-time.Infrastructure Tools",
    "Alchemy": "Alchemy provides the SDK and APIs to build multichain Web3 DApps, and the skills\nto use them through a community/university-like initiative.\n\nDevelopers can use the free tools to create smart contracts for multiple use\ncases and multiple blockchain targets.\n\nAlchemy has inspired +$100 Billion worth of transaction value on-chain, with\nnorth of 10M end users, and royalties upwards of $1,5B.Infrastructure Tools",
    "Alchemy Rundler": "Alchemy's Rundler is an open-source ERC-4337 compliant bundler for smart contract wallets. Built by Alchemy engineers, this bundler is allows smart contract wallet developers to use SC wallet primitives to enable seamless onboarding, improved security, and advanced features. \n\n\nWeb3 Wallet Tools",
    "Chainlink": "Chainlink is a DeFi oracle that gives Ethereum-based smart contracts access to\nreal-world data and off-chain computation. Their products include data feeds,\nVerifiable Random Numbers (VRF), calling external APIs, and automated contracts.\nThe protocol is meant to be able to verify whether the parameters of a smart\ncontract with real-world data are independent of stakeholders. DeFi Tools",
    "Alchemy University": "Alchemy University (previously Chainshot) offers a suite of web3 education courses including a FREE, 3-week Javascript for blockchain beginners course and a FREE 7-week Ethereum Developer Bootcamp. The web3 JavaScript crash course covers the basics of programming through advanced topics to prepare developers for learning Solidity and building Ethereum dapps. The Ethereum Developer Bootcamp includes interactive coding challenges, video lessons, projects and expert instructors that teach you how to build smart contracts, master solidity, and become a web3 developer. Mint your NFT today to enroll in Alchemy University!Web3 Developer Tools",
    "ApeWorx EVM Trace": "ApeWorx's Python-dependent tracing tool for Geth and Parity style tests with Gas\nand Call-tree results reporting.\n\nDevelopers can pip install the EVM Trace quickstart and run tests in a Python\nenvironment or contribute custom tests to the project.\n\nApeWorx EVM Trace has +100 forks, stars, and contributors.Solidity Tools",
    "Fire": "Our friend lost his Ape, so we built a tool that shows a preview of what will enter and exit your wallet, before you sign. Web3 is hard to use. Self-custody and interacting directly with the blockchain today is overly complicated for the consumer, leading to the average user losing their funds and quitting the ecosystem. UX today is fraught with “gotchas” and pitfalls. Fire is a Chrome extension that simulates transactions, showing you exactly what will go in and out of your wallet before you sign the contract. All under your control with your current wallet.Web3 Wallet Tools",
    "Aave": "Aave protocol allows users to borrow and lend from over 30 Ethereum-based\nassets.  Aave Protocol users can switch between stable and variable rates,\ndepending on their preference and the state of the market, and take out flash\nloans.\n\n Aave also provides pools for real-world assets, like real estate, cargo and\nfreight invoices, and payment advances with the use of its partner company,\nCentrifuge. Their governance token AAVE lets users vote on Aave Improvement\nProposals (AIPs).DeFi Dapps",
    "Arbitrum": "Arbitrum is an Eth layer2 scaling solution that supports smart contracts without\nthe limitations of scalability and privacy. Users enjoy low transaction fees and\nless congestion on Arbitrum. Arbitrum allows developers to create smart\ncontracts by using code to specify the behavior of a virtual machine (VM) that\nimplements the contract’s functionality. Additionally, developers can use\nArbitrum for dramatic improvements in scalability and privacy.Blockchains",
    "Starknet": "StarkNet is a Zero-Knowledge Rollup (ZK-Rollup) that is decentralized,\npermissionless, and censorship-resistant. It supports general computation over\nEthereum. \n\nDevelopers create applications on StarkNet allowing users to send transactions\nthe same way they do with Ethereum today. All StarkNet transactions are\nperiodically batched, and their validity is proven on a stark proof, which is\nthen verified on the Ethereum Blockchain.Blockchains",
    "Arweave": "Arweave is a protocol where everyone can host their data without the fear of\ncensorship or degradability. The permaweb sits on the Arweave protocol, and it\nhosts all of the products in the network.\n\nArweave has profit-sharing communities, Ardrive, and Verto.Infrastructure Tools",
    "Stripe Identity": "Programmatically confirm the identity of your users to prevent fraud while minimizing friction for real customers. Trusted by companies like Discord, Clubhouse, and more, Stripe's Identity solution enables developers to easily support Know Your Customer (KYC) rules, validate ID documents from over 100 countries, and detect fake IDs with advanced machine learning. Once implemented, Stripe Identity makes it easy for developers to integrate with Stripe's network of payment products like payouts, subscriptions, and other financial connections.Identity Tools",
    "Manticore": "Released in 2017 by TrailOfBits, Manticore provides a symbolic execution tool\nfor the analysis of Ethereum smart contracts, Linux ELF binaries, and WASM\nmodules.\n\nManticore automatically generates new inputs based on a state, detects crashes\nand failure cases, and explores the states a program can reach.  Using\ninstruction hooks and callbacks, devs are given precise control of state\nexploration.\n\nShipped with a wiki, examples, and an API-reference guide, Manticore provides\ndevs the resources necessary to make full-use and custom-use of its interface.Solidity Tools",
    "ZettaBlock": "ZettaBlock provides enterprise-grade, full-stack Web3 infrastructure for indexing and analytics needs, joining real-time on-chain and off-chain data. App developers can build low-latency, reliable GraphQL APIs via SQL and Python in minutes. Users no longer worry about decoding blockchain data, configuring their data warehouses, data pipelines, databases, and API endpoints. Infrastructure Tools",
    "Alchemy NFT API": "With Alchemy's NFT, API developers don't need to build their ideas from scratch.\nA single request/line replaces tens of lines of code.\n\nDevelopers can build custom NFT tracking apps, marketplaces, or even minting\nplatforms with secure token transactions.\n\nThe Alchemy NFT API is benchmarked to perform up to17-times faster than market\ncompetitors and spots more than double the usage.NFT Tools",
    "OKX Wallet": "With OKX Wallet, you can explore Web3 and take control of your crypto, NFTs, and digital assets all in one secure wallet. \nThe key features of OKX Wallet include: (1.) Simple: The simplest way to explore Web3. Store ,trade, earn, and manage crypto, NFTs, and digital assets across 50+ blockchains.; (2.) Powerful: Built-in access to multi-chain DEX, NFT Marketplace, Earn, and thousands of dAapps. Manage your digital assets across OKX Exchange and Web3 Wallet seamlessly under one unified experience.; (3.) Secure: Complete control of your crypto, keys, and data – exclusive access to your funds; choose what to share and what to keep private.Web3 Wallets",
    "Coinbase Wallet": "Coinbase wallet is an EVM compatible software wallet, launched in 2018 by the\ncreators of the Coinbase platform. Users can purchase ERC-20 tokens, NFTs and\ntake part in airdrops. Developers can use Coinbase wallet to connect directly to\ntestnet faucets in a wallet extension and integrate into dapps and protocols for\nlending and payment. Web3 Wallets",
    "Lighthouse": "Lighthouse has undergone rigorous scrutiny, resulting in impressive security and\nfunctionality. The Rust implementation allows an extremely performant and\nsustainable consensus layer at many different scales. Lighthouse is maintained\nactively by the Sigma Prime organization, guaranteeing updated compatibility\nwith all Ethereum changes.Infrastructure Tools",
    "EthFiddle": "EthFiddle is a product of the Loom Network, a multichain platform providing\ndevelopers with infrastructures to build faster.\n\nYou do not need to download anything before you can use EthFiddle. It was built\nto be operated within browsers.\n\nPerhaps the most distinguishing feature of EthFiddle is the link-sharing\nfeature. With this, developers can share their code with a single link.Web3 Developer Tools",
    "Lit": "Lit can be used to read and write data between blockchains and off-chain platforms, facilitating encryption, access control, and automation for the open web via programmatic signing. On a fundamental level, Lit is an attempt to decentralize public key cryptography. This includes building apps with private data using identity-based encryption, facilitating more seamless onboarding experiences for non-crypto natives with MPC wallets, and more. To learn more, visit [our developer documentation](https://developer.litprotocol.com/).Identity Tools",
    "Astar": "Astar Network provides the infrastructure for building dApps with EVM and WASM smart contracts offering developers true interoperability with cross-consensus messaging (XCM) and a cross-virtual machine (XVM). Astar’s unique Build2Earn model empowers developers to get paid through a dApp staking mechanism for the code they write and dApps they build. Astar is home to 50+ dApps and 500,000 community members.Blockchains",
    "Alchemy Ventures": "With the goal of bringing blockchain to a Billion people, the parent company\nAlchemy introduced an investment firm called Alchemy ventures.\n\nAlchemy ventures is a VC funding empowering developers and communities that are\nbuilding gaming, metaverse, Defi, or web3 applications using Blockchain\nTechnology.Venture Capital Firms",
    "DraftKings Marketplace": "Before the advent of NFTs, DraftKings was a betting platform for fantasy sports players. Recently, it added an NFT marketplace to its offerings.\n\nFantasy sports are a popular aspect of both football and video games. Draft \\Kings makes it possible to buy NFTs that celebrate famous sports icons and add a new experience to fantasy sports.NFT Dapps",
    "Nansen Portfolio": "Create unlimited DeFi portfolios by bundling wallets across over 40 chains and over 500 protocols! Connect your wallet and get an in-depth view of your DeFi holdings powered by data from Nansen. Gain insights from Nansen's 240 million labeled wallets and comprehensive data analytics. Trading Tools",
    "IPFS": "IPFS is one of the leading storage dApps in Web3 due to its unique solutions and\npopularity. It solves most issues that limit the present storage system by\nproviding a secure and permanent storage system.\n\nIPFS is accessible to all as it is available on browsers, desktops, and the CLI.Infrastructure Tools",
    "Castle": "Castle is a smart contract wallet for NFT collectors. Our product allows anyone to easily create and manage a shared or personal vault using multi-signature wallet technology. Individuals can use Castle as a vault to securely store assets, or use it as a trading wallet to get powerful features like advanced portfolio tracking and batch transactions. Groups can use Castle as a shared wallet to pool funds together, buy NFTs, manage a shared treasury, and split profits. Some key features of Castle include: (1.) Native integrations with OpenSea, Gem.xyz and Genie.xyz which aggregates NFTs from a variety of marketplaces, allowing you to buy or sell multiple NFTs in a single transaction, sweep the floor, or list multiple NFTs all at once; (2.) Purchase NFTs and list single or multiple NFTs in one transaction via Castle's native marketplace; (3.) Track portfolio data such as NFT floor prices, purchase prices, and token balances; and (4.) Team up with friends to create a group, invite people, contribute funds, and manage ownership settings.Web3 Wallets",
    "Alchemy SDK": "The Alchemy SDK is considered the best web3 development platform on the market. \n\nSimple, efficient, and comprehensive, the Alchemy SDK is easiest way to create\nand connect your dapp to the blockchain. \n\nDevelopers can use the Alchemy SDK to access a variety of web3 tools for APIs,\nNFTs, wallets, data analytics, and much more. \n\nOffering multi-chain support and its best-in-class infrastructure, Alchemy’s SDK\nis an all-around powerhouse for dapp development. \n\nWeb3 Developer Tools",
    "Coinbase": "Coinbase Global, Inc., branded Coinbase, is an American publicly traded company\nthat operates a cryptocurrency exchange platform. Users can buy, sell, earn,\nborrow cryptocurrency, use the Coinbase Wallet to store cryptocurrency as well\nas collect NFTs and trade derivatives. Developers can access the Coinbase cloud\nfor developer tools and API.Trading Tools",
    "Etherscan": "Built in 2015 by Block Solutions Sdn Bhd, Etherscan is an Ethereum block\nexplorer and analytics platform. Users can see and analyze assets, balances and\ntransactions on the Ethereum network. Developers can interact with smart\ncontracts and view gas prices on Etherscan. Etherscan is one of the most trusted\nand popular block explorers for Ethereum. Web3 Developer Tools",
    "Solady": "Inspired by the Solmate project, Solady provides a library of Solidity snippets\noptimized for appropriate gas utilization.\n\nDevelopers can contribute gas-optimized Solidity snippets such as\nECDSA,  LibString, Sort, LibBitmap, MerkleProof, and SafeTransferLib.\n\nAlthough used by hundreds of developers, no guarantees are given, and further\naudits and optimization are encouraged.Solidity Tools",
    "ENS": "he Ethereum Name Service (ENS) is a distributed, open, and extensible naming\nsystem based on the Ethereum blockchain. ENS's job is to map human-readable\nnames like 'alice. eth' to machine-readable identifiers such as Ethereum\naddresses, other cryptocurrency addresses, content hashes, and metadata.Web3 Wallet Tools",
    "Compound": "Compound in a decentralized lending protocol that allows users to borrow, lend,\nand earn interest in the same type of tokens they've lent. Compound also allows\nfor tokenization of assets locked in the system by using their governance token\n(COMP). \n\nAs of August 2022, the platform announced Compound III, which keeps user\ncollateral from being distributed after it is deposited.DeFi Dapps",
    "Apex": "Apex Wallet is an Ethereum wallet that supports wallet-to-wallet in-app\nmessaging. Users can use it for in-wallet messaging to securely send messages to\nfriends, communicate with specific NFT holders, or communicate with members of a\nshared DAO.\n\n\n\nApex offers in-app web3 messaging as well as security features to blur the\ncontents of your wallet, a simple user interface, and colorful sections for\nviewing NFTs.Web3 Wallets",
    "Scaffold-ETH": "Tinkering on Ethereum is difficult because the stack is complicated. The goal of Scaffold-ETH is to make forking the development stack easy through a frontend that adapts to smart contracts. Developers can tinker, learn, and also find a template that matches their needs. Learn how to build on Ethereum and with a few tweaks, have a dapp ready to deploy with Scaffold-ETH.Web3 Developer Tools",
    "Floor": "Floor helps its users understand their NFTs, discover new ones and participate in the Web3 communities behind tokens through a user-friendly mobile app. The Floor app has supported over 1,000s of NFT enthusiasts in the past year and is now available in the App Store & Play Store.NFT Dapps",
    "MakerDAO": "MakerDAO is a decentralized organization dedicated to bringing stability to the\ncryptocurrency economy. Users can earn interest on the DAI they keep in the\nDAO's bank as well as make decisions for the Maker Protocol. Developers can use\nthe DAI API to access data end-points and integrate them within programmes.DeFi Dapps",
    "1inch": "The initial protocol of the 1inch Network is a decentralized exchange (DEX) aggregator that sources liquidity from various exchanges and is capable of splitting a single trade transaction across multiple DEXes. Smart contract technology empowers this aggregator enabling users to optimize and customize their trades. The 1inch Network was launched at the ETHGlobal New York hackathon in May 2019 with the release of its Aggregation Protocol v1. Since then, the 1inch Network has developed additional DeFi tools such as the Liquidity Protocol, the Limit Order Protocol, P2P transactions, the Fusion mode, and the 1inch Wallet app.DeFi Dapps",
    "a16z crypto": "Andreessen Horowitz (known as \"a16z\") is a venture capital firm that backs bold\nentrepreneurs building the future through technology. It was founded in Silicon\nValley in 2009 by Marc Andreessen and Ben Horowitz. \n\nThey invest in seed to late-stage technology companies across bio + healthcare,\nconsumer, crypto, enterprise, fintech, games, and companies aspiring to American\ndynamism. a16z manages $35 billion in assets across multiple funds.Venture Capital Firms",
    "Cronos": "Supported by Crypto.com, Crypto.org and more than 400 app developers and partners, Cronos is an EVM-compatible layer 1 blockchain. Their mission is to make it easy and safe for the next billion crypto users to adopt Web3, with a focus on DeFi and GameFi.Blockchains",
    "Nametag": "With a Nametag profile, you can connect multiple wallets across various chains, curate a gallery, and then port that profile into popular apps like Twitter, Youtube, and Discord, as well as metaverses, games, and experiences. Users can interact with our ecosystem through our Chrome extension. \n\nIdentity Tools",
    "Dropspace": "Dropspace is the easiest way to launch your own NFT collection. They personally work with you to handle all technical aspects of your mint. They just require artwork from you and they can take care of the following aspects of an NFT project: (1.) Smart contracts; (2.) Unique dedicated web page on our site; (3.) Web3 website; (4.) IPFS pinning; (5.) Image layering/generation; (6.) Opensea setup and reveal; and (7.) Minting window for the community. NFT Tools",
    "Founders Fund": "Founders Fund was launched in 2005 with the mission to invest in smart people solving difficult problems. Founders Fund is led by technology innovators including Peter Thiel, Brian Singerman, and Joey Krug. Founders Fund has invested in multiple digital assets and web3 products including Bitcoin, Paxos, Bullish, and most recently, Block Green, a lending protocol for Bitcoin miners lacking access to capital. Founders Fund most notably earned $1.8B from Bitcoin investments that were sold during the 2021 bull market.Venture Capital Firms",
    "Plaid Wallet Onboard": "Wallet Onboard allows developers to connect their apps to more than 300 self-custody crypto wallets with a single integration. Wallets may come on many platforms with different challenges, but Wallet Onboard guides users through the simplest steps for every scenario.\nWallet Onboard gets updated on an ongoing basis as new wallet integrations are added. Instead of staying up to date and managing multiple libraries to integrate new wallets into the onboarding experience, Wallet Onboard does this for developers automatically. Web3 Wallet Tools",
    "Cookbook": "The Cookbook is a community-sourced collection of smart contracts for developers to download code and use to their liking.\n\nUsers can browse a growing number of smart contracts by searching use cases or blockchains.\n\nDevelopers can offer new smart contracts, contribute to quality-checking existing contracts and add support for more chains through a discord community.\n\nCookbook also supports Metis, Cronos, Ethereum Classic, Aurora, Fantom, Fuse, Milkomeda, Boba, Moonbeam, and Moonriver.Solidity Tools",
    "Create Web3 dApp": "Create Web3 DApp is an npx package that allows developers to create anything from a simple, barebones dApp to a feature-rich decentralized platform, in ~2 minutes. The create-web3-dapp package is a NextJs-based framework, compatible with the most used blockchains including Ethereum, Polygon, Optimism, Arbitrum, Solana, that helps web3 developers build a decentralized production-ready application at lightning speed, using pre-made React components, webhooks, and APIs. For more information, read the create-web3-docs on docs.alchemy.com.DeFi Tools",
    "Flashbots": "Founded in 2020 by Stephane Gosselin, Flashbots is a research and development\norganization that works on mitigating the negative externalities of Maximal\nExtractable Value (MEV) techniques on blockchains. It distinguishes itself by\nusing a three-pronged approach, involving transparency of MEV activity and\ndemocratization and sustainable distribution of MEV revenue.\n\nFlashbots is primarily used by Ethereum searchers and validators to benefit from\nefficient and transparent MEV extraction. DeFi Tools",
    "Delphi Digital": "Delphi Digital is an independent research boutique providing institutional-grade\nanalysis on the digital asset market.\n\nUsers can use Delphi’s research to make informed investment decisions about\ntheir favorite web3 projects. \n\nIndustry-leading research insights provide a deeper understanding of critical\nconcepts within the crypto ecosystem. \n\nDelphi Digital is actually an umbrella company for several entities including a\nresearch firm, venture firm, and asset creation firm. DeFi Tools",
    "Juicebox": "Juicebox is a multipurpose DAO-tooling platform that enhances quick building and\nmanagement of DAOs. \n\nJuicebox was designed for DAOs that want to crowdfund or NFT projects that want\nto create a seamless community-building experience. \n\nA lot of high-profile DAOs have sprung up from Juicebox, including the renowned\nConstitution DAO and Assange DAO. DAO Tools",
    "Metaplex": "Launched in August 2021, Metaplex is one of the largest protocols on Solana. It\nenables creators and developers to mint, sell, and manage non-fungible tokens\n(NFTs). With Metaplex Studio, users can launch customized NFT collections\nwithout any coding involved. \n\nFor developers, Metaplex offers a range of tools and software development kits,\nincluding Candy Machine, for minting and distribution, Auction House, for\nselling, and Token Metadata, for adding NFTs to projects. NFT Tools",
    "Nansen": "Launched in 2019, Nansen is a blockchain analytics platform that provides tools\nand dashboards to help users access data from multiple blockchains. Nansen users\ncan get macro perspective on tokens, look up smart contracts, track wallets,\ndiscover non-fungible tokens (NFTs) data, and conduct due diligence. \n\nThe platform also records, labels, and analyzes over 50 million wallets to add a\ncontextual layer to on-chain data. Nansen claims that this helps its users make\nbetter investment decisions. DeFi Tools",
    "Dfns": "Dfns is the most secure wallet-as-a-service infra founded in 2020 in Paris. Dfns is Techstars-backed, SOC 2-certified, and has raised over $20M since its creation. Dfns is an API-first KMS designed to provide app developers with secure, plug-and-play access to blockchains based on an decentralized, MPC-driven key management network with built-in recovery mechanisms, operated by error-and-attack-resilient tier 3+/4 data centers. Dfns is designed with focus on developer experience to maximize programmability, minimize high-touch implementations, and provide granular sets of permissions, controls and policies via secure API credentials (encrypted WebAuthn 2FA). We support 40+ blockchains and 1,000+ tokens.Web3 Wallets",
    "OpenZeppelin": "Provided through a stable API, OpenZeppelin Contracts provides an interface for\ndevelopers to build Solidity and Cairo smart contracts.\n\nDevelopers can leverage secure practices to build ECR20, ECR721, ECR1155,\nGoverner, and custom smart contracts through interactive wizard tools or with\nRemix.\n\nMore than 30k developers follow and use OpenZeppelin's tools and libraries to\nbuild Web3 DApps. Solidity Tools",
    "Paragraph": "Paragraph allows users to write Web3-powered newsletters. Users can token-gate\ntheir content with Paragraph. Users can write content, grow an audience and\nfoster a community with Paragraph. Developers can also build on Paragraph upon\nrequest. Unlike other newsletter sites, Paragraph has a faster page load time as\nwell as permanent and uncensorable storage.Web3 Social Dapps",
    "Solidity": "Solidity was originally proposed in August 2014 and was developed by the\nEthereum foundation as the first ever smart contract programming language. Seen\nin its syntax and inheritance, Solidity is heavily influenced by C++, Python and\nJavaScript. Developers using Solidity can find the largest smart contract\ndeveloper community online and a wealth of compatible tools. There are over 8\nmillion deployed smart contracts written in Solidity.Web3 Developer Tools",
    "Mirror World": "Mirror World is a full-stack Web3 App development platform that means everything from Web2/Web3 login methods to NFT marketplace, wallet integration, and NFT launch are all covered in the SDK with minimal code required. All you need to do is plug in once, integration time is under 30 minutes, and the APIs are all yours. Aside from these primary features, we do have other auxiliary functions such as a UI dashboard, open storefront, data monitoring tools, and so on, to minimize your development effort.NFT Tools",
    "Velodrome": "The team behind veDAO, a Fantom-native protocol spearheaded by Andre Conje,\ncreated Velodrome Finance to serve as one of the pillar of DeFi protocols within\nthe Solidly ecosystem.\n\n\n\nUsers with Ethereum-native wallets can interact swiftly with the Velodrome\nFinance interface.\n\n\n\nThe DeFi protocol has many products and offerings including swapping, vesting,\nbribing, and liquidity pool.DeFi Dapps",
    "Decentral Games": "Decentral Games is a decentralized autonomous organization (DAO) that builds games and social experiences in the Metaverse. Our flagship game is ICE Poker, the first Metaverse poker platform. We also host daily Metaverse events featuring prizes, live music, and more. DG DAO members can submit proposals, vote, and help shape the future of Decentral Games.DAOs",
    "Harbor": "Harbour is a Lightspeed and Alchemy-backed infrastructure provider looking to\noffer Web3 startups a secure space to test their products before hitting the\nmarket.\n\nSelect users get to test project ideas before they're deployed for public\naccess.\n\nDevelopers can use their infrastructure to develop, test, and deploy proof of\nconcept models of their Web3 business ideas.Web3 Security Tools",
    "Celestia": "Celestia, previously known as LazyLedger, is the world's first modular\nblockchain network. It is a pluggable consensus and data availability layer that\nallows anyone to quickly deploy a decentralized blockchain without having to\nbootstrap a new consensus network.\n\nCelestia modularizes the blockchain technology stack and opens up new\npossibilities for decentralized application builders by decoupling the consensus\nand application execution layers.Blockchains",
    "Coinbase Ventures": "Coinbase ventures support exceptional entrepreneurs, working to advance the\ncrypto/Web3 ecosystem and Coinbase's mission of increasing global economic\nfreedom.\n\nThey work with founding teams from the beginning and invest broadly across all\nsectors of the crypto economy.\n\nThey've invested in hundreds of teams that are working on everything from layer\n1 protocols to Web3 infrastructure, centralized on-ramps, decentralized finance,\nNFTs, metaverse technologies, developer tooling, and more.Venture Capital Firms",
    "Aragon": "Aragon is one of the oldest and most used DAO builders. Several DAOs have used\nthe Aragon platform to create their community and economy. \n\nAccording to the site, the platform was created by Luis Cuende and Jorge\nIzquierdo in 2017 to checkmate how the government often censors communities.  \n\nWithin Aragon itself, there are several other sub-DAOs that sustain it for\nmaximal efficiency. DAO Tools",
    "Harpie": "Harpie monitors your wallet hundreds of times a second. When we detect a malicious transaction or transfer, we're able to stop that transaction in transit. By using Harpie, you can use Web3 without having to constantly worry about being hacked or scammed.Web3 Security Tools",
    "Binance.US": "Created by Binance and its U.S. partner BAM Trading Services, Binance.US is a\ncryptocurrency exchange for residents of the United States. Users on the\nplatform can buy, sell, trade, convert and stake over 120 popular\ncryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Solana (SOL), and\nCardano (ADA).Trading Tools",
    "Connext": "The ethos of Connext is to herald a time when the end users would not even know\nthe actual chain they are using, as it aims to strike a high-level composability\nin the blockchain industry.\n\nConnext has a decentralized network of routers that earn as they facilitate the\nactivities of the bridge and secure it at the same time.DeFi Tools",
    "HelloMoon": "HelloMoon.io is a human readable index of Solana. Users can explore all NFT\ncollections, DeFi tokens, and protocols on the Solana blockchain using the site,\nas well as connect their wallet to access their portfolio. Developers can use\nthe API to track on-chain activity. HelloMoon.io labels the wallets that are\nengaging in each ecosystem.NFT Tools",
    "Lenster": "Lenster is a composable, decentralized, and permissionless social media web app\nbuilt with Lens Protocol. It is well known in the community as Lens’ first Web3\nsocial experience that acts as the most full-featured way to use Lens Protocol\nto interact with your social graph. It functions similarly to Twitter both in\nlayout and execution, with added support for a variety of NFT types.Web3 Social Dapps",
    "Circle Yield": "USD Coin(USDC) issuer Circle launched its yield program in June 2021 to enable\ninstitutional investors to earn interest by lending out USDC. Users can deposit\na minimum of $100,000 USDC, which is lent out to Circle Bermuda. The assets are\nthen allocated to investment partners who lend it out in the capital crypto\nmarket. The users receive interest in USDC — the interest rates are updated\nweekly and the loan terms range from one to 12 months.DeFi Dapps",
    "Alchemy Transact": "Alchemy Transact offers a suite of services that make sending transactions\ncheaper, faster and more reliable, especially in moments when transactions are\nmore likely to fail. Alchemy Transact offers users a Reinforced Transactions\nengine which automatically tracks and re-sends transactions if they are not\ngoing through, so users don't have to worry about transactions getting dropped\n(especially during network congestion). Developers can use private transactions\nendpoints and real-time alerts when transactions are mined or dropped from the\nmempool.Web3 Developer Tools"
}